app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("created_at", "updated_at", "user_id", "content") VALUES('2011-01-19 17:22:08', '2011-01-19 17:22:08', 1, 'i am sebastian')
---
 def create
    @micropost  = current_user.microposts.build(params[:micropost])
    if @micropost.save

DELETE FROM "microposts" WHERE "id" = 7
---
  def destroy
     @micropost.destroy