app/controllers/users_controller.rb

  def index
    @title = "All users"
    @users = User.all
---
SELECT * FROM "users"

 def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "admin", "remember_token", "email") VALUES('yanglee', '28be1910d52af95172eacda5e0383ba6e6bde8400bba87cba50220e1297c5704', 'd5b72475edcc81f67442310e260d37ba8c2eab5f8a85d5384ba320a15d7bd335', '2011-01-19 01:32:18', '2011-01-19 01:32:18', NULL, NULL, 'yanglee@gmail.com')

def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "id" = 3
SELECT * FROM "users" WHERE ("users"."id" = 3)